print("""

                     /|        /|
                  `__||       //__'
                     ||      ||
                    __||    ||'__/
                     ` ||  //_'
                     _.,:---;,._
                     \_:     :_/
                       |@. .@|
                       |     |
                      ,|.    |_
                       ;;`-'   `---__________-----.-.
                       ;;;                           |
                       ';;;                          |
                        ;    |                       ;
                         \   \     \        |        |
                          \_, \    /        \     |  |
                            |';|  |,,,,,,,,/ \    /  |
                            |  |  |           \   /  |
                            |  |  |           (  / (  |
                             | || |           | |   | |
                             | || |           | |   | |
                             | || |           | |   | |
                             |_||_|           |_|   |_|
                            /_//_/           /_/   /_/
""")

print("================================================================================")
print("어서 오세요. 사슴 카페입니다.")
packaging = input("포장 여부를 선택해 주세요. 포장 OR 매장 식사:")

if packaging == "포장":
    print()
    print(packaging + "을 선택하셨습니다.")
    print()
    print("================================================================================")
elif packaging == "매장 식사":
    print()
    print(packaging + "를 선택하셨습니다.")
    print()
    print("================================================================================")
elif packaging == "매장식사":
    print()
    print(packaging + "를 선택하셨습니다.")
    print()
    print("================================================================================")
else:
    print("다시 선택해 주세요.")
    print()
    print("================================================================================")

menu = ['','아메리카노', '카페라떼', '프라푸치노', '과일주스']
price = [0, 3000, 3800, 4500, 4500]
bill = [0, 5000, 10000, 15000, 20000]


def menu_print():
    i = 1
    while i< len(menu):
        print(i, menu[i], price[i])
        i = i+1

def menu_select():
    print("================================================================================")
    n = int(input("음료를 선택하세요(번호 입력) :"))
    price_sum = price[n]
    if n < 4 : 
        menu_add = input("시럽을 추가하시겠습니까? 예 또는 아니오 입력:")
        if menu_add == "예":
            print("================================================================================")
            coffee_add = input("각설탕, 바닐라 시럽, 헤이즐넛 시럽, 토피넛 시럽:")
            print(coffee_add + "을 추가하셨습니다.")
            print(menu[n], price[n],"원 ", " 결제 금액 ", price_sum, "원")
        else:
            print("================================================================================")
            print("결제를 진행해주세요")
            print(menu[n], price[n],"원 ", " 결제 금액 ", price_sum, "원")
    else:
            print("================================================================================")
            print("과일을 선택해주세요.")
            juice = input("딸기, 키위, 바나나, 망고, 블루베리, 레몬:")
            add=input(juice + " 주스를 추가하셨습니다.(Enter입력)")
            print(menu[n], price[n],"원 ", " 결제 금액 ", price_sum, "원")
           
           

    while n != 0:
        print()
        print("================================================================================")
        n = int(input("음료를 추가하려면 음료 번호를, 결제는 0을 입력하세요 :"))
        if n > 0 and n < len(menu):
            if n < 4 : 
                menu_add = input("시럽을 추가하시겠습니까? 예 또는 아니오 입력:")
                if menu_add == "예":
                    print("================================================================================")
                    coffee_add = input("각설탕, 바닐라 시럽, 헤이즐넛 시럽, 토피넛 시럽:")
                    print(coffee_add + "을 추가하셨습니다.")
                    price_sum = price_sum + price[n]
                    print(menu[n], price[n],"원 ", " 결제 금액 ", price_sum, "원")
                    
                else:
                    print("================================================================================")
                    print("결제를 진행해주세요")
                    price_sum = price_sum + price[n]
                    print(menu[n], price[n],"원 ", " 결제 금액 ", price_sum, "원")
            else:
                print("================================================================================")
                print("과일을 선택해주세요.")
                juice = input("딸기, 키위, 바나나, 망고, 블루베리, 레몬:")
                add=input(juice + " 주스를 추가하셨습니다.(Enter입력)")
                price_sum = price_sum + price[n]
                print(menu[n], price[n],"원 ", " 결제 금액 ", price_sum, "원")

        else :
            if n == 0 :
                print("주문이 완료되었습니다.")
            else :
                print("없는 메뉴입니다.")
    return price_sum


def menu_pay(total_price):

    for i in range (1, len(bill)):
        print( i,'.',bill[i],'원',end='   ')
    print()

    pay = 0
    while pay < total_price:
        n = int(input("지불 금액을 입력하세요(번호 입력), 분할 결제 가능 : "))
        if n>0 and n<len(bill):
            pay = pay + bill[n]
            print('총 지불액 :', pay,'원')
        else :
            print('다시 선택하세요.')

    print('거스름돈 ', pay-total_price, '원')
    print("스트로우와 티슈는 카운터 앞에 있습니다.")
    print("저희 매장을 찾아주셔서 감사합니다:)")

menu_print()
total = menu_select()
menu_pay(total)


